task1 = input('Input text here: ')

# 1.	Определите является ли строка записью числа. (Подсказка: ищите как это сделать с помощью методов строк)

print('Task1 result:')
if task1.isdigit():
    print('Input row is a string')
else:
    print('Input row is NOT a string')

# 2.	Посчитайте сколько у вас пробелов в строке.
