
# 1. Вычислите длину гипотенузы в прямоугольном треугольнике со сторонами 179 и 971.
from math import sqrt

print('\n\nTask1 result:')
a = 179
b = 971
c = round(sqrt(a ** 2 + b ** 2), 3)
print(c)

# 2. Дано двузначное число. Найдите число десятков в нем.
print('\n\nTask2 result:')

given_number = int(input('Enter your number:'))



# 3.	Дано трехзначное число. Найдите сумму его цифр.
print('\n\nTask3 result:')

