# 1)	Напишите счетчик с помощью конструкции while, который выводит числа от 0 до 10.
print('task 3.1 :', end=' ')
x = 0
while x <= 10:
    print(x, end=' ')
    x += 1

# 2)	Напишите счетчик с помощью конструкции while, который выводит числа от 20 до 1.
print('\n' + 'task 3.2: ', end=' ')
y = 20
while y != 0:
    print(y, end=' ')
    y -= 1
