# 3) ITEmployee (наследуемся от Employee)
# 1. Реализовать метод добавления одного навыка в новое свойство skills (список) новым методом add_skill
# (см. презентацию).
# 2. * Реализовать метод добавления нескольких навыков в новое свойство skills (список) новым методом add_skills.
# Тут можно выбрать разные подходы: или аргумент один и он список навыков, которым вы расширяете список-свойство skill,
#  или вы принимаете неопределённое количество аргументов и все их добавляете в список-свойство skill
from Lecture5.Homework.Employee import Employee


# class ITEmployee(Employee):
#     def __init__(self):